# RbsParallelpipesVerticalOffsetValue Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsParallelpipesVerticalOffsetValue Property
ParameterTypeId Class See Also
---
"Vertical Offset value for parallel pipes"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsParallelpipesVerticalOffsetValue { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsParallelpipesVerticalOffsetValue As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsParallelpipesVerticalOffsetValue {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace